Revit 2024 API
StructuralAsset.WoodGrade Property
 The grade of wood used in a wood-based asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public string WoodGrade { get; set; }
Visual Basic
Public Property WoodGrade As String
	Get
	Set
Visual C++
public:
property String^ WoodGrade {
	String^ get ();
	void set (String^ value);
}
Remarks
 Applies to wood-based structural assets.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
Autodesk.Revit.Exceptions.InapplicableDataException |  When setting this property: the material type must be wood to set this property.
See Also
StructuralAsset Class
Autodesk.Revit.DB Namespace